let handler = async (m, { conn }) => {
  let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
  let pp = ('./src/img-menu.png')
  let { name } = global.db.data.users[who]
  
let str = `*┏☫─━━─━☾♦️☽━┈━━┈☫┓*

*⧉┆اهــلا  _" ${name} "_*
──── • ◈ • ────
*⧉┆أنـا اسـمـــي "${botname}"*
*⧉┆ قـبــل کــل امــر ضــع ( . )*
*⧉┆هــا لــك شــرح كـامــل لـأوامــري ☟*

*━┅┄⊣☫﹝📜﹞☫⊢┄┅━*

☬┇امر *.منشن* مع کتابة رساله ، هو ان المشرف یکتب الامر و البوت یمنشن جمیع الأعضاء في الجروب مع قائمة المناشن
•
*مـثــال : .منشن (الرساله)*
──── • ◈ • ────
☬┇امر *.مخفي* مع کتابة رساله ، هو ان المشرف یکتب الامر *مع رساله او بدون رساله* و البوت یمنشن منشن جماعي للاعضاء  بدون قائمة المنشن
•
*مـثــال : .مخفي (الرساله)*
──── • ◈ • ────
☬┇امر *.الجروب* هو ان العضو یکتب هذا الامر و البوت یرسل معلومات الجروب مع الوصف
──── • ◈ • ────
☬┇امر *.انذار* مع کتابة السبب ، هو ان المشرف یکتب الامر مع کتابة السبب للعضو و بعد تلقي العضو *3 انذار* الانذار *الثالث* یطرد العضو من الجروب ، الرد بالامر علی *رساله او منشن العضو*
•
*مـثــال : .انذار (السبب)╎.انذار @... سبام*
──── • ◈ • ────
☬┇امر *.رفع-انذار* مع منشن العضو ، هو ان المشرف بعد ما اعطی العضو انذار *واحد او ...* من اصل *ثلاث* یمکن کتابة هذا الامر لحذف الانذار
•
*مـثــال : .رفع-انذار (المنشن)*
──── • ◈ • ────
☬┇امر *.الانذارات* هو ان العضو او المشرف یشوف عدد تلقي انذاراته من قبل المشرف بکتابته هذا الامر
──── • ◈ • ────
☬┇امر *.أية-الكرسي* ، یرسل البوت آية الکرسي
──── • ◈ • ────
☬┇امر *.ايه* مع کتابة الرقم ، هو ان البوت یرسل نص الایة من القرأن مع الترجمة الانجلیزية و مع *صوت قرائة الايه* و العضو یکتب الامر و امام الامر رقم السورة القرأن  و أیة السورة ، اذا کان *سورة 'مريم' الرقم "19" في القرأن* اولا یکتب العضو رقم السوره *و بعدها رقم الايه*
•
*مـثــال : .ايه 19 1*
──── • ◈ • ────
☬┇امر *.ملصق* مع الرد علی *صوره و ...* ، هو ان العضو یستخدم هذا الامر بالرد علی *صوره - فيديو* و البوت یحوله لملصق
──── • ◈ • ────
☬┇امر *.حقوق* مع الرد علی *ملصق* ، هو ان العضو یستخدم هذا الامر لتغییر حقوق الملصقات
•
*مـثــال :  .حقوق دارك مان| dark man*
──── • ◈ • ────
☬┇امر *.لصوره* هو ان العضو یرد علی *ملصق ثابت* باستخدام هذا الامر و البوت یحول الملصق لصوره
──── • ◈ • ────
☬┇امر *.لفيديو* هو ان العضو یستخدم هذا الامر بالرد علی *ملصق متحرك* و البوت یرسل الملصق علی شکل فيديو
──── • ◈ • ────
☬┇امر *.لصوت* هو ان العضو یرد علی *فيديو* باستخدام هذا الامر و البوت یسحب الصوت من الفيديو ویرسل للعضو *صوت الفيديو او mp3*
──── • ◈ • ────
☬┇امر *.انطق* مع کتابة النص ، هو ان العضو یکتب الامر و امام الامر النص و البوت یرسل النص علی شكل رسالة صوتیه
•
*مـثــال : .انطق دارك مان*
──── • ◈ • ────
☬┇امر *.نسبه* مع کتابة رساله ، هو ان العضو يكتب الامر و امام *النص* والبوت یرسل نسبة من *%1 الی %100*
•
*مـثــال : .نسبه ذكائي*
──── • ◈ • ────
☬┇امر *.خط* مع کتابة رساله ، هو ان العضو یکتب الامر و *النص باللغة الإنجلزیة* و یرسل البوت قائمة الخطوط النص علی فونتات متنوعة
•
*مـثــال : .خط dark man*
──── • ◈ • ────
☬┇امر *.بوت* ، هو ذكاء اصطناعي *بـChatGPT*
•
*مـثــال : .بوت متی اخترع اول کمبيوتر*
──── • ◈ • ────
☬┇امر *.بروفايل* البوت یرسل معلومات ملفك الشخصي
──── • ◈ • ────
☬┇امر *.المطور* یرسل البوت رقم مطور البوت *دیــابـلــو*
──── • ◈ • ────
☬┇امر *.الدعم* یرسل البوت رابط جروب البوتات للتحدیثات

*━┅┄⊣☫﹝📜﹞☫⊢┄┅━*

*⧉┆مـلاحــظــة :* 
*⓵يمنع منعا بتا سب البوت*
*⓶استخدام البوت بشكل متوازن و بدون تسبب ازعاج للاعضاء*

*┗☫─━━─━☾♦️☽━┈━━┈☫┛*


*_'𝙳𝚒𝚊𝚋𝚕𝚘 - 𝙳𝚊𝚛𝚔 𝚖𝚊𝚗'_*`
  conn.sendFile(m.chat, pp, 'darkman.png', str, m, false, { mentions: [who] })
  m.react(done)
}

handler.help = ['main']
handler.tags = ['group']
handler.command = ['شرح']

export default handler
